Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G51E.tmx
Source language: en_us
Languages: zh_cn

source: Jack Welch 22
zh_cn: 杰克韦尔奇自传22

source: I have always felt that chemical engineering was one of the best backgrounds for a business career, because both the classwork and required thesis teach you one very important lesson: there are no finite answers to many questions.
zh_cn: 我常常想化学工程学是销售工作的最基础知识。因为不管是课堂作业还是毕业论文都告诉你很重要的一点：很多问题没有特定答案。

source: A typical exam question went something like this: an ice-skater weighs 150 pounds and is doing figure-eights on ice an inch thick.
zh_cn: 举个典型的例子，有个问题是这样的：一个溜冰者，体重150磅，在一英寸厚的冰面上划“8”字形溜冰。

source: The temperature is rising a degree every ten minutes to 40 degrees, and the wind is blowing 20 miles an hour. When will the skater fall through the ice?
zh_cn: 温度每十分钟增加一度直到40度，风速是20英里/小时，问：溜冰者什么时候将冰块滑穿？

source: There was no formulaic answer to that question.
zh_cn: 这个问题根本没有标准答案。

source: The same is true for most business problem.
zh_cn: 这和很多管理问题一样。

source: The process helps you get closer to the darker shade of gray. There are rarely black-or-white answers.
zh_cn: 这让你更加摸不清方向，商业没有明确的是非标准。

source: More often than not, business is smell, feel, and touch as much as or more than numbers.
zh_cn: 更进一步说，管理不管闻起来，感觉起来还是摸起来，都更像一堆数字。

source: If we wait for the perfect answer, the world will pass us by.
zh_cn: 如果我们静待最佳答案的出现，我们往往错过了时机。

source: By the time I left Illinois in 1960, I had decided what I liked and wanted to do and, just as important, what I wasn't so good at. My technical skills were pretty good, but I wasn't the best scientist by any means.
zh_cn: 当我1960年从伊利诺斯州大学毕业时，我已经做好打算什么是我想去做的，以及同样重要的是，什么是我所不擅长的。

source: Compared to many of my classmates, I was outgoing, someone who loved people more than books, and sports more than scientific developments.
zh_cn: 与我的很多同学相比，我是一个另类，喜欢更多和人交往而不是书本，喜欢体育胜过科学发展。

source: I figured those skills and interests were best suited for a job that bridged the laboratory and the commercial world.
zh_cn: 我列举出那些最适合我的行当，就是实验室或者从商。

source: Knowing that was a little bit like knowing I was a pretty good athlete¡ªbut far from a very good one.
zh_cn: 这种认识就好比我认识到我是一个确实不错的运动员—但远不是一个优秀运动员。

source: What I wanted to do made me something different from most Ph.D.s. They usually went into university classrooms to teach or corporate laboratories to do research.
zh_cn: 我想要从事的行业使我很其他的哲学博士有很大的不同。忒慢通常到大学去教书，或者企业实验室去做科研。

source: I toyed with the idea of teaching, and even interviewed at Syracuse and West Virginia Universities, but in the end I decided against that option.
zh_cn: 我没怎么考虑去做教师，虽然还去参加了锡拉库扎和西维吉尼亚大学的面试，但最后我都打消了这个念头。

source: Besides a degree, long-term friendships, and a way of thinking through problems, Illinois gave me something else: a great wife.
zh_cn: 除了学位、永远的友谊以及思考问题的方式，伊利诺斯州大学还给了我：一位伟大的妻子。

source: I first spotted Carolyn Osburn at the Catholic church on-campus doing the Stations of the Cross during Lent.
zh_cn: 首次遇见卡洛琳 奥斯本，是在天主教堂校园内纪念耶稣受难的四旬斋期间。

source: She attended mass, just as I did.
zh_cn: 她经常参加活动，跟我一样。

source: I didn't meet her, however, until a mutual friend introduced us in a bar in downtown Champaign.
zh_cn: 但我之前从未见过她，直到我们的一个共同的朋友在平原市商业中心的一个活动时介绍了我们。

source: Carolyn was tall, pretty, sophisticated and intelligent.
zh_cn: 卡洛琳高挑、漂亮、沉稳还很聪明。

source: She had graduated with honors from Marietta College and was on a $1,500-a-year fellowship at Illinois, getting her master's in English literature.
zh_cn: 她以优异的成绩从玛丽埃塔大学毕业，在伊利诺斯州大学有每年1500美元奖学金，主修英国文化。

source: After our first date at a basketball game in January 1959, we were always together.
zh_cn: 1959年我们在一个篮球比赛第一次约会后，我们就总是在一起。

source: Five months later, we were engaged and on November 21, two days after my 24th birthday, we were married in her hometown of Arlington Heights, Illinois.
zh_cn: 五个月后，11月21日，也就是我24岁刚过两天，我们在她的家乡伊利诺斯州的阿林顿高地举办了婚礼。

source: We spent the bulk of our honeymoon driving my Volkswagen across the country and into Canada, with me interviewing for jobs.
zh_cn: 我们的蜜月就是自驾甲壳虫穿越美国去到加拿大，顺便进行我的工作面试。
